<main>
    <div class="container-fluid px-0">
    <h1 class="text-center pt-5 mt-md-5">Prestations</h1>

        <section class="pb-5">
            <!-- TITRE CATEGORIE -->
            <!-- ------------------------------------------------------------------------------------------------------------------------------ -->
            <div class="row mx-0 px-md-5 pb-md-5 mt-lg-5">
                <div class="col">
                    <h2 class="category-title text-center py-4 my-5"><?= $category->name ?></h2>
                    <?php if (!empty($category->description)) { ?><p class="service-text text-center pt-md-5 mt-md-5"><?= $category->description ?></p><?php } ?>
                </div>
            </div>
            <!-- ------------------------------------------------------------------------------------------------------------------------------ -->

            <!-- AFFICHAGE DU GENRE -->
            <!-- ------------------------------------------------------------------------------------------------------------------------------ -->
            <?php
            include(__DIR__ . './templates/services/gender.php');
            ?>
            <!-- ------------------------------------------------------------------------------------------------------------------------------ -->



            <!-- PARTIE PRESTATIONS -->
            <!-- ------------------------------------------------------------------------------------------------------------------------------ -->
            <div class="row justify-content-center mx-0">

                <!-- GRANDE IMAGE -->
                <div class="col-xl-11 col-xxl-10">
                    <picture>
                        <source srcset="../public/uploads/categories/<?= $id ?>-xl.webp" type="image/webp" media="(min-width: 1200px)">
                        <img src="../public/uploads/categories/<?= $id ?>.webp" alt="Illustration de la catégorie <?= $category->name ?>" class="img-fluid services-line-img">
                    </picture>
                </div>

            </div>

            <?php if (!empty($female_services)) { ?>
                <section id="female">
                    <!-- SECTION PRESTATIONS EXCLUSIVES -->
                    <!-- ------------------------------------------------------------------------------------------------------------------------------ -->
                    <?php if (!empty($female_exclusives)) { ?>
                        <section class="pt-md-4">
                            <h3 class="subtitle text-center my-5 pt-xl-5">Les exclusives</h3>

                            <div class="special-section py-5">
                                <div class="bg-main py-5">
                                    <!-- ========================================================================================================================== -->
                                    <?php foreach ($female_exclusives as $key => $service) {
                                        include(__DIR__ . './../views/templates/services/service_line.php');
                                    } ?>
                                    <!-- ========================================================================================================================== -->
                                </div>
                            </div>
                        </section>
                    <?php } ?>
                    <!-- ------------------------------------------------------------------------------------------------------------------------------ -->

                    <!-- SECTION PRESTATIONS CLASSIQUES -->
                    <!-- ------------------------------------------------------------------------------------------------------------------------------ -->
                    <?php if (!empty($female_classics)) { ?>
                        <section class="pt-4">
                            <h3 class="subtitle text-center my-5 pt-xl-5">Les classiques</h3>

                            <div class="classic-section py-5">
                                <div class="bg-main py-5">
                                    <!-- ========================================================================================================================== -->
                                    <?php foreach ($female_classics as $key => $service) {
                                        include(__DIR__ . './../views/templates/services/service_line.php');
                                    } ?>
                                    <!-- ========================================================================================================================== -->
                                </div>
                            </div>

                        </section>
                    <?php } ?>
                    <!-- ------------------------------------------------------------------------------------------------------------------------------ -->

                    <!-- SECTION FORFAITS -->
                    <!-- ------------------------------------------------------------------------------------------------------------------------------ -->
                    <?php if (!empty($female_packages)) { ?>
                        <section class="pt-4">
                            <h3 class="subtitle text-center my-5 pt-xl-5">Les forfaits</h3>

                            <div class="package-section py-5">
                                <div class="bg-main py-5">
                                    <!-- ========================================================================================================================== -->
                                    <?php foreach ($female_packages as $key => $service) {
                                        include(__DIR__ . './../views/templates/services/service_line.php');
                                    } ?>
                                    <!-- ========================================================================================================================== -->
                                </div>
                            </div>
                        </section>
                    <?php } ?>
                    <!-- ------------------------------------------------------------------------------------------------------------------------------ -->
                </section>
            <?php } ?>


            <?php if (!empty($male_services)) { ?>
                <section <?= (!empty($female_services) && !empty($male_services)) ? 'class="d-none"' : '' ?> id="male">
                    <!-- SECTION PRESTATIONS EXCLUSIVES -->
                    <!-- ------------------------------------------------------------------------------------------------------------------------------ -->
                    <?php if (!empty($male_exclusives)) { ?>
                        <section class="pt-md-4">
                            <h3 class="subtitle text-center my-5 pt-xl-5">Les exclusives</h3>

                            <div class="special-section py-5">
                                <div class="bg-main py-5">
                                    <!-- ========================================================================================================================== -->
                                    <?php foreach ($male_exclusives as $key => $service) {
                                        include(__DIR__ . './../views/templates/services/service_line.php');
                                    } ?>
                                    <!-- ========================================================================================================================== -->
                                </div>
                            </div>
                        </section>
                    <?php } ?>
                    <!-- ------------------------------------------------------------------------------------------------------------------------------ -->

                    <!-- SECTION PRESTATIONS CLASSIQUES -->
                    <!-- ------------------------------------------------------------------------------------------------------------------------------ -->
                    <?php if (!empty($male_classics)) { ?>
                        <section class="pt-4">
                            <h3 class="subtitle text-center my-5 pt-xl-5">Les classiques</h3>

                            <div class="classic-section py-5">
                                <div class="bg-main py-5">
                                    <!-- ========================================================================================================================== -->
                                    <?php foreach ($male_classics as $key => $service) {
                                        include(__DIR__ . './../views/templates/services/service_line.php');
                                    } ?>
                                    <!-- ========================================================================================================================== -->
                                </div>
                            </div>

                        </section>
                    <?php } ?>
                    <!-- ------------------------------------------------------------------------------------------------------------------------------ -->

                    <!-- SECTION FORFAITS -->
                    <!-- ------------------------------------------------------------------------------------------------------------------------------ -->
                    <?php if (!empty($male_packages)) { ?>
                        <section class="pt-4">
                            <h3 class="subtitle text-center my-5 pt-xl-5">Les forfaits</h3>

                            <div class="package-section py-5">
                                <div class="bg-main py-5">
                                    <!-- ========================================================================================================================== -->
                                    <?php foreach ($male_packages as $key => $service) {
                                        include(__DIR__ . './../views/templates/services/service_line.php');
                                    } ?>
                                    <!-- ========================================================================================================================== -->
                                </div>
                            </div>
                        </section>
                    <?php } ?>
                    <!-- ------------------------------------------------------------------------------------------------------------------------------ -->
                </section>
            <?php } ?>

            <!-- BOUTON DE RDV -->
            <!-- ------------------------------------------------------------------------------------------------------------------------------ -->
            <?php
            include(__DIR__ . './templates/services/btn_appointment.php');
            ?>
            <!-- ------------------------------------------------------------------------------------------------------------------------------ -->

            <!-- PRODUITS -->
            <!-- ------------------------------------------------------------------------------------------------------------------------------ -->
            <?php
            include(__DIR__ . './templates/services/products.php');
            ?>
            <!-- ------------------------------------------------------------------------------------------------------------------------------ -->

        </section>

    </div>
</main>